Repository: lenoryv/collective.spanishdocumentation
Catalog: buildout.coredev/omegat/project_save.tmx
Source language: en_us
Languages: es_ve

source: Reference (a.k.a.
es_ve: Referencia (a.k.a.

source: Reference the PLIP in the bug, assign to its implementor, and add a tag for the PLIP in the form of plip-xxx.
es_ve: Haga referencia al PLIP en el fallo, asigne a su implementador, y añadir una etiqueta para el PLIP en forma de plip-xxx.

source: Remember your audience - to get support for your proposal, people will have to be able to read it!
es_ve: Recuerde su audiencia - que le puede dar apoyo a su propuesta, las personas tendrán que ser capaces de leerla!

source: Reviewing PLIPs ===============
es_ve: Revisando PLIPs ===============

source: Run bin/buildout -c pil.cfg to install.
es_ve: Ejecutar bin/buildout -c pil.cfg a instalar la librería PIL.

source: STOP!
es_ve: ¡DETENTE!

source: Second, please ask for help setting up your environment in IRC.
es_ve: Segundo, por favor, pida ayuda para configurar su entorno en el canal IRC.

source: See http://pypi.python.org/pypi/mr.developer for more information or run 'bin/develop help' for a list of available commands.
es_ve: Ver http://pypi.python.org/pypi/mr.developer para mayor información o ejecutar el comando 'bin/develop help' para un lista de comando disponibles.

source: See http://plone.org/documentation/manual/developer-manual/client-side-functionality-javascript/javascript-standards/referencemanual-all-pages
es_ve: Ver http://plone.org/documentation/manual/developer-manual/client-side-functionality-javascript/javascript-standards/referencemanual-all-pages

source: See https://raw.github.com/plone/plone.app.caching/master/CHANGES.rst for a full example.
es_ve: Ver https://raw.github.com/plone/plone.app.caching/master/CHANGES.rst para un ejemplo completo.

source: Setting up Your Development Environment --------------------------------------- The first step in fixing a bug is getting this buildout running.
es_ve: Instalando su Entorno de Desarrollo ----------------------------------- El primer paso en corregir un fallo está consiguiendo ejecutar este buildout correctamente.

source: Setting up the environment -------------------------- Follow the instructions on [wiki:DevelopmentEnvironment setting up a development environment] for "Getting the Code".
es_ve: Instalando el entorno --------------------- Seguir las instrucciones en [wiki:DevelopmentEnvironment setting up a development environment] para "Conseguir el Código".

source: Simple packages with limited functionality can get by with a single page of narrative documentation.
es_ve: Los paquetes sencillos con funcionalidad limitada pueden ser una página sola de narrativa documentación.

source: Simply ask on of the Framework Team members what PLIPs are available for review or check the status of PLIPs at XXX:Link.
es_ve: Simplemente pregunte a los miembros del equipo de Framework cual PLIPs esta disponible para revisar o verifficar el estatus del PLIPs en XXX:Link.

source: Simply ask on of the Framework Team members what PLIPs are available for review or check the status of PLIPs at the `following link <https://dev.plone.org/report/24>`_.
es_ve: Simplemente pregunte a los miembros del equipo de Framework cual PLIPs esta disponible para revisar o verificar el estatus del PLIPs en el `siguiente enlace <https://dev.plone.org/report/24>`_.

source: So you have a bug fix for 4.x.
es_ve: Entonces usted tiene un corrección de falla para 4.x.

source: Some excellent examples of a single-page readme are http://pypi.python.org/pypi/plone.outputfilters and https://github.com/plone/plone.app.caching
es_ve: Algunos ejemplos excelentes de una página sencilla de archivo readme son http://pypi.python.org/pypi/plone.outputfilters y https://github.com/plone/plone.app.caching

source: Sphinx will poop out a file directory that you can put in your browser url to validate.
es_ve: Sphinx colocara en un directorio que tu puedes consultar en tu navegador web para validar la documentación generada.

source: Standy for bugs!
es_ve: Esperar por los nuevos fallos!

source: Still with me?
es_ve: Aun me sigue?

source: Style Guide ===========
es_ve: Guía de estilos ===============

source: Submit a PLIP (at any time) #.
es_ve: Presentar un PLIP (en cualquier tiempo) #.

source: Submitting a PLIP can be a great learning process and we encourage people of all backgrounds to submit.
es_ve: La presentación de un PLIP puede ser un gran proceso de aprendizaje y animamos a la gente de todos los orígenes a presentar.

source: Submitting the agreement is easy (and will soon be easier) and if you want quick access and are familiar with the community, go into :doc:`irc <culture>` and ask one of the repo admins to give you access with a scanned copy of the agreement.
es_ve: Enviando el acuerdo de contribución es fácil (y pronto será más fácil) y si quieres acceso rápido y es familiar con comunidad, ir dentro :doc:`irc <culture>` y preguntar por los administradores del repositorio para dar acceso con una versión digitalizada del acuerdo.

source: Summary: As soon as you get it done.
es_ve: Resumen: Tan pronto usted lo finalice.

source: Switching Branches ^^^^^^^^^^^^^^^^^^ If your bug is specific to one branch or you think it should be backported, you can easily switch branches.
es_ve: Cambiar Branches ^^^^^^^^^^^^^^^^ Si su fallo es especifico en una branch o usted piensa que debería hacer backport, usted puede cambiar fácilmente las branches.

source: Table of Awesome ---------------- ..
es_ve: Tabla de contenidos ---------------- ..

source: Take the plone.app.caching example.
es_ve: Tome de ejemplo el paquete plone.app.caching.

source: Testing Locally --------------- In an ideal world, you would write a test case for your issue before actually trying to fix it.
es_ve: Probando localmente ------------------- En un mundo ideal, usted debería escribir un caso de prueba para su incidencia antes de tratar de corregirlo.

source: Thank you in advance!
es_ve: ¡Gracias de antemano!

source: That or I got lazy when writing these docs.
es_ve: Si le dio pereza escribir estas PLIP tan documentado.

source: That way, it is easier to see what was done when, and easier to roll back any changes if necessary.
es_ve: De esta forma, es fácil ver que fue cambiado y donde se realizo el cambio, además es mas fácil hacer un roll back de cualquier cambio si es necesario.

source: The Framework Team is happy to help you at any point in the process.
es_ve: El equipo del Framework estará encantado de ayudarle en cualquier momento del proceso.

source: The Framework Team will assign 2-3 people to review your PLIP.
es_ve: El equipo del Framework asignara 2 a 3 personas para revisar su PLIP.

source: The PLIP will not be merged until all blockers and critical bugs are fixed.
es_ve: El PLIP no será fusionado hasta que todo los fallos bloqueadores y críticos están corregido.

source: The Plone 4.x Framework Team reviews all PLIPs to be sure that it’s in the best interest of the broader community to be implemented and that it is of high quality.
es_ve: El equipo del framework Plone 4.x revisa todas las PLIPs para ser seguro que es en el mejor interés de la comunidad para ser implementada y que es de calidad alta.

source: The basics ~~~~~~~~~~
es_ve: Lo básico ~~~~~~~~~

source: The best way to do this is to add Sphinx to your project and host your docs on readthedocs.org so that it rebuilds the documentation whenever you push to github.
es_ve: La manera mejor de hacer este es para añadir Sphinx a su proyecto y hospedar su documentos en readthedocs.org de modo que reconstruye la documentación siempre que aplica un cambio en github.com

source: The changelog is a record of all the changes made to the package and who made them, with the most recent changes at the top.
es_ve: El changelog o registro de cambios es un registro de todos los cambios que hizo al paquete y quién les hicieron, con los cambios más recientes en la parte superior.

source: The code base is very complicated and everyone is vested in the right thing happening.
es_ve: El código base es muy complicado y todo el mundo se confiere al acontecimiento lo correcto.

source: The default username/password for a dev instance is admin/admin.
es_ve: El usuario y contraseña por defecto para una instancia Zope de desarrollo es admin/admin.

source: The error looks like::
es_ve: El error luce así::

source: The first is to delete all instances of host filtering.
es_ve: Lo primero es eliminar todas las instancias del host filtrado.

source: The first time you get a branch, you must do::
es_ve: La primera ves usted tiene que obtener una branch, usted debe hacer::

source: The former is obviously much easier to read, less redundant and generally more aesthetically pleasing.
es_ve: A la primera es, obviamente, mucho más fácil de leer, menos redundante y por lo general estéticamente más agradable.

source: The framework team is eager to reduce it’s own workload and will re-classify it for you.
es_ve: El equipo del framework es ansioso al reducir es propia carga de trabajo y clasificarla de nuevo por usted.

source: The key point here is that each change needs documentation so other users can see what it is.
es_ve: El punto clave acá es que cada cambio necesita documentación para que otros usuarios puedan ver que cambios hay de nuevo.

source: The line with a * by it will indicate which branch you are currently working on.
es_ve: La línea con un * por él indicará qué rama actualmente estás trabajando.

source: The mailing list is exploding with debate over what is better so we'll leave the excersize of deciding what to do with the user.
es_ve: La lista de correo es la explosión de debates sobre que es lo mejor, así que nosotros vamos a dejar el ejercicio de decidir qué hacer con el usuario de esta lista.

source: The manual (a.k.a.
es_ve: El manual (a.k.a.

source: The manual goes into further depth for people who want to know all about how to use the package.
es_ve: El manual va a una profundidad más lejana para personas que quieren saber todo acerca de cómo para utilizar el paquete.

source: The manual should consider various audiences who may need different types of information:
es_ve: El manual debería considerar varias audiencias quiénes pueden necesitar tipos diferentes de información

source: The merge may cause problems with other PLIP's coming in.
es_ve: La fusión puede causar problemas con otros PLIPs que vienen en camino.

source: The most common workflow to get all the latest updates is:
es_ve: El mas común flujo de trabajo para obtener todas la ultimas actualizaciones es:

source: The other option is to delete your current egg and force the upgrade.
es_ve: La otra opción es eliminar el paquete egg actual y forzar la actualización.

source: The people in #plone-framework have been using plone for a very long time and are happy to help you get going and make the right decisions.
es_ve: La gente en la sala IRC #plone-framework tienen mucho tiempo usando Plone y por eso estarán muy felices en ayudarle a ir por la dirección correcta y hacerle tomar las decisiones mas adecuadas.

source: The point is that they are safely deletable.
es_ve: El punto es que son de seguramente se pueden eliminar.

source: The problem with swallowed exceptions is not just poor error reporting.
es_ve: El problema con las swallowed exceptions,no es sólo el informe de errores pobre.

source: The readme is the first entry point for most people to your package.
es_ve: El archivo README es el primer punto de partida para la mayoría de personas a su paquete.

source: The reviewers are informal and very nice so don't worry - they are there to help!
es_ve: Los revisores son informales y muy agradables, así que no se preocupe - que están ahí para ayudar!

source: The second option is to allow the host that it is pointing to by adding something like this to your .cfg::
es_ve: La segunda opción es el permitir al host al cual ese apunta para ser añadido de algo como esto a su archivo .cfg::

source: The seconder field is REQUIRED.
es_ve: El campo seconder es REQUERIDO.

source: Then rerun buildout to get the source packages::
es_ve: Entonces ejecutar de nuevo buildout para conseguir los paquetes de sus repositorios fuente::

source: Then you return to the feature branch and make a branch for `rebasing` it onto the 4.2 branch::
es_ve: A continuación, regrese a la branch característica y haga una branch para `establecerlo` dentro de la branch 4.2::

source: Then, follow the simple instructions for :doc:`reviewing a PLIP <plipreview>`.
es_ve: Entonces, siga las simples instrucciones para :doc:`revisar un PLIP <plipreview>`.

source: Then, follow the simple instructions for reviewing a PLIP (XXX:link).
es_ve: Entonces, siga las simples instrucciones para revisar un PLIP (XXX:link).

source: There are many people and companies who rely on Plone on a day-to-day basis so we have to introduce some level of code quality control.
es_ve: Hay muchas personas y compañías quiénes confían en Plone diariamente, por tanto nosotros tenemos que introducir algún nivel de control en la calidad del código fuente.

source: There are people who look once a week or more for pending pull requests and will confirm whether or not its a good fix and give you feedback where necessary.
es_ve: Hay personas que se ven una vez a la semana o más para revisar las solicitudes pull requests y confirmaran si es o no es una buena corrección y le dará una retroalimentación cuando sea necesario.

source: There are plenty of opportunities to meet the community and start contributing through various coding sessions, either in person or on the web.
es_ve: Hay abundancia de oportunidades de conocer la comunidad y comenzar a contribuir a través de varias sesiones de codificación, ya sea en persona o en la web.

source: There are two ways to get this error to go away.
es_ve: Hay dos maneras de obtener este error desaparezca.

source: There is no official people assigned to this so if you are especially nervous, jump into #plone and ask for a quick eyeball on your changes.
es_ve: Hay personas no oficiales asignadas a esto si usted esta especialmente nervioso, entre en el canal IRC en freenode.net y pregunte por alguien que pueda ver sus cambios.

source: There may be conflicts; if so, resolve them and then follow the directions git gives you to complete the cherry-pick.
es_ve: Tal ves allá conflictos; entonces, resolverlos y seguir las instrucciones que la herramienta git le da a usted para completar el cherry-pick.

source: These are ok to ignore IF and ONLY IF the lines following it say::
es_ve: Estos errores están bien para ser ignorados SI y SÓLO SI las líneas que siguen diga::

source: These are open for contributions by anyone.
es_ve: Estos son abiertos para contribuciones por cualquier que lo deseo hacer.

source: These are the criterias by which the framework team will review your review bundle:
es_ve: Estos son los criterios por del equipo framework que va a revisar en su revisión del paquete:

source: These documents are currently stored with the coredev buildout in github in /docs.
es_ve: Estos documentos actualmente son almacenados con el directorio /docs del buildout de coredev en github.

source: These errors are almost always a quick fix and a little bit of understanding goes a long ways.
es_ve: Estos errores son casi siempre tienen una solución rápida y un con poco de comprensión le lleva a un largo camino.

source: These should all run without error.
es_ve: Estos deberían ejecutarse todo sin fallos.

source: These tickets often rotted in place and technically, in order for us to accept your patch you must sign the contributors agreement.
es_ve: Estos tickets a menudo podridas en su lugar y técnicamente, para que nosotros aceptemos su parche debe firmar el acuerdo de los contribuyentes.

source: They always do... * `Python Imaging Library (PIL) <http://www.pythonware.com/products/pil/>`_.
es_ve: Ellos siempre hacen... * `Python Imaging Library (PIL) <http://www.pythonware.com/products/pil/>`_.

source: They are there to push you through completion as well as answer any questions and provide guidance.
es_ve: Ellos están ahí para animar hasta su culminación, así que responde a cualquier pregunta y proporcionar orientación necesaria.

source: They will follow the guildelines listed at :doc:`plipreview`.
es_ve: Ellos seguirá las lineas guías definidas en :doc:`plipreview`.

source: They will get you going as fast as possible!
es_ve: ¡Ellos lo harán lo mas rápido como sea posible!

source: Things to think about when reviewing:
es_ve: Las cosas para pensar aproximadamente cuándo este revisando:

source: Think about how an import would read::
es_ve: Piensa acerca de como un import podría leerse::

source: This buildout uses mr.developer to manage package development.
es_ve: Esta configuración buildout usa mr.developer para administrar los paquetes de desarrollo.

source: This can also mask ConflictErrors, which indicate that something has gone wrong at the ZODB level!
es_ve: Sino que esto también puede ocultar errores de conflicto (ConflictErrors), que indican que algo ha ido mal en el nivel de la ZODB!

source: This can be in the form of an issue tracker entry, or a PLIP in the case of a bigger change.
es_ve: Esto puede ser en el formulario de un registro de en el sistema de incidencia, o un PLIP en el caso de que es un cambio mayor.

source: This change note will be collated for the next Plone release and is important for integrators and developers.
es_ve: Esta nota de cambio será cotejada para la próxima versión de Plone y es importante para los integradores y desarrolladores.

source: This file should be called plip_<number>_notes.txt.
es_ve: Este debería ser llamado plip_<number>_notes.txt.

source: This file will define the branches/trunks you're working with in your PLIP.
es_ve: Es archivo sera definido en el branches/trunks que usted esta trabajando con su PLIP.

source: This has the advantage that you can instantly see if you refer to a module / file or a class::
es_ve: Esto tiene la ventaja de que usted puede ver inmediatamente si se refiere a un módulo / archivo o una clase::

source: This is a limited set of documentation that is intended to be carefully managed and regularly updated.
es_ve: Esto es un conjunto limitado de documentación que está pretendido para ser cuidadosamente dirigido y regularmente actualizado.

source: This is bad and could cause all sorts of whack out errors when you start or try to run things because it never actually downloaded the package.
es_ve: Esto es malo y puede causar todo tipo de errores al iniciar o tratar de hacer las cosas porque nunca se llegan a descargar el paquete.

source: This is by no means an exhaustive list, but a place to start.
es_ve: Esto es de ninguna manera una lista exhaustiva, pero un sitio para empezar.

source: This is maintained separately from the git commit history to give a chance for more user-friendly messages and to and record when releases were made.
es_ve: Esto está mantenido por separado del historial de revisión del git para dar una posibilidad de mensajes mas amigables al usuario al registrar cuándo las liberaciones estuvieran listas.

source: This is usually the result of the developer not responding to feedback or dropping out of the process.
es_ve: Esto es usualmente a que el resultado del trabajo hecho por el desarrollador no responde al comentario o abandono del proceso.

source: This just tells the release manager that any eggs below this line have tests that are updated, but no code changes.
es_ve: Este dice al administrador de la versión que los paquetes Egg por debajo de esta línea tienen pruebas que están actualizadas, pero no hay cambios en el código.

source: This leads to a wealth of information that is of more widely ranging quality.
es_ve: Esto dirige a una riqueza de información que es de más ampliamente variando calidad.

source: This lets the release manager know that the package has been updated so that when the next release of Plone is cut a new egg will be released and Plone will need to pin to the next version of that package.
es_ve: Esto le permite al administrador de la versión saber que paquete ha sido actualizado para que cuando sea la próxima versión de Plone tendrá que fijar a la próxima versión del paquete al momento de generar un nuevo paquete Egg.

source: This lets you deal with resolving conflicts before you actually merge it to the 4.2 release branch.
es_ve: Este le permite a usted resolver conflictos antes de que usted lo fusione a la branch release 4.2.

source: This may go back and forth a few times until both the FWT and developer are happy with the result.
es_ve: Esto puede ir y venir varias veces hasta que tanto el FWT y el desarrollador está satisfecho con el resultado.

source: This means that we can NOT accept pull requests from you unless this is done, so please don't put the code reviewers at risk and do it anyways.
es_ve: Esto significa que NO podemos aceptar peticiones de mejoras de usted a no ser que allá hecho esto, por favor, ponga código fuente para ser revisado de ninguna forma.

source: This method does not work on Windows, so we're unable to run it by default.
es_ve: Este método no funciona en Windows, así que nosotros somos incapaces de correr él por defecto.

source: This offers both copyright protection and ensures that the Plone Foundation is able to exercise some control over the codebase, ensuring it is not appropriated for someone's unethical purposes.
es_ve: Esto ofrece protección de derechos de autor y se asegura de que la Fundación Plone es capaz de ejercer un cierto control sobre el código base, asegurándose de que no es apropiado para fines poco éticos de alguien.

source: This should include (but is not limited to):
es_ve: Este debe incluir (pero no es limitado a solo eso):

source: This should set up a local 4.1 branch tracking the one on github.
es_ve: Esto debería crear una branch local de 4,1 rastrear el uno en github.

source: This tells your [Plone] bootstrap.py file to play nicely with the version that you already have installed.
es_ve: Esto le dice a su archivo bootstrap.py [Plone] para ejecutar muy bien con la versión que ya se ha instalado.

source: This way the implementor can find help if he needs it.
es_ve: De este modo el implementor puede encontrar ayuda si lo necesita.

source: This will get you the latest coredev configuration, checkout and update all packages via Subversion in src and run buildout to configure the whole thing.
es_ve: Esto te conseguirá la versión mas reciente de la configuración coredev, compruebe y actualice todos los paquetes vía Subversion en el directorio src y ejecute buildout para configurar el asunto.

source: This will make a remote branch in github.
es_ve: Esto hará un branch remoto en el servicio github.

source: This will remove packages from src/ which are no longer needed, as they have been replaced by proper egg releases of these packages.
es_ve: Esto sacará los paquetes del directorio src/ los cuáles ya no son necesarios, cuando estos han sido reemplazados por una apropiada liberación en formato Egg de estos paquetes.

source: This will run for a long time if it is your first pull (~20 mins).
es_ve: Esto se ejecutará durante mucho tiempo, si es su primera ejecución de buildout (~ 20 minutos).

source: This will turn your request into a pull request on the main branch.
es_ve: Este le permitirá hacer una solicitud dentro de un pull request en la branch principal.

source: To add Sphinx to your package...
es_ve: Para añadir Sphinx a su paquete...

source: To check your changes locally, rerun buildout and then::
es_ve: Para generar sus cambios localmente, inicie de nuevo el buildout y entonces::

source: To fix, simply do::
es_ve: Para solucionar, simplemente ejecute el siguiente comando::
